#    -*- mode: org -*-


Archived entries from file /home/masnes/org/work.org


** DONE [#1] [0/0] Look into lite eclipse click-ability     :status meeting:
CLOSED: [2015-10-27 Tue 18:43] :LOGBOOK: CLOCK: [2015-10-27 Tue 17:32]--[2015-10-27 Tue 17:32] =>  0:00
*** DONE [#2] Check up on a last few difficult licenses
CLOSED: [2015-10-29 Thu 12:57]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:53]--[2015-10-29 Thu 12:57] =>  0:04
CLOCK: [2015-10-29 Thu 12:07]--[2015-10-29 Thu 12:18] =>  0:11
:END:
*** DONE [#2] Insure all links to licenses work.
CLOSED: [2015-10-29 Thu 12:52]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:42]--[2015-10-29 Thu 12:52] =>  0:10
CLOCK: [2015-10-29 Thu 12:37]--[2015-10-29 Thu 12:40] =>  0:03
:END:
** DONE [#1] Remind Mary
CLOSED: [2015-10-30 Fri 15:09] DEADLINE: <2015-10-30 Fri>
:LOGBOOK:
CLOCK: [2015-10-30 Fri 15:06]--[2015-10-30 Fri 15:09] =>  0:03
:END:
Mary said that it's a good feature request. But didn't imply that it was a 
release showstopper.
